src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Сотрудники/ObjectModule.bsl
Процедура ПередЗаписью ( Отказ )
	
	Если ( ЭтоНовый () И ПустаяСтрока ( Наименование ) ) Тогда
		заполнитьНаименование ();
	КонецЕсли;	
	
КонецПроцедуры

Процедура заполнитьНаименование ()
	
	Если ( ЗначениеЗаполнено ( Фамилия ) ) Тогда
		Наименование = СокрЛП ( Фамилия );
		Если ( ЗначениеЗаполнено ( Имя ) ) Тогда
			Наименование = Наименование + " " + Лев ( СокрЛП ( Имя ), 1 ) + ".";
			Если ( ЗначениеЗаполнено ( Отчество ) ) Тогда
				Наименование = Наименование + " " + Лев ( СокрЛП ( Отчество ), 1 ) + ".";
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры
